In [1]:
# data science imports
import pandas as pd
import matplotlib.pyplot as plt

# census data imports
import censusdis.data as ced
import censusdis.maps as cem

# other imports
import os

In [46]:
# get state convenience data
from censusdis.states import MN, NY, NC

In [47]:
MN

'27'

In [48]:
# Load the API key
with open("../census_api_key.txt", "r") as f:
    CENSUS_API_KEY = f.read().strip()

# print(CENSUS_API_KEY)

In [49]:
# marital status by age
table = "B12002"

In [63]:
ced.variables.group_tree(
    "acs/acs1",
    2023,
    group_name = table
)

+ Estimate
    + Total: (B12002_001E)
        + Male: (B12002_002E)
            + Never married: (B12002_003E)
                + 15 to 17 years (B12002_004E)
                + 18 and 19 years (B12002_005E)
                + 20 to 24 years (B12002_006E)
                + 25 to 29 years (B12002_007E)
                + 30 to 34 years (B12002_008E)
                + 35 to 39 years (B12002_009E)
                + 40 to 44 years (B12002_010E)
                + 45 to 49 years (B12002_011E)
                + 50 to 54 years (B12002_012E)
                + 55 to 59 years (B12002_013E)
                + 60 to 64 years (B12002_014E)
                + 65 to 74 years (B12002_015E)
                + 75 to 84 years (B12002_016E)
                + 85 years and over (B12002_017E)
            + Now married: (B12002_018E)
                + Married, spouse present: (B12002_019E)
                    + 15 to 17 years (B12002_020E)
                    + 18 and 19 years (B12002_021E)
                    + 20 to 24 years (B12002_022E)
                    + 25 to 29 years (B12002_023E)
                    + 30 to 34 years (B12002_024E)
                    + 35 to 39 years (B12002_025E)
                    + 40 to 44 years (B12002_026E)
                    + 45 to 49 years (B12002_027E)
                    + 50 to 54 years (B12002_028E)
                    + 55 to 59 years (B12002_029E)
                    + 60 to 64 years (B12002_030E)
                    + 65 to 74 years (B12002_031E)
                    + 75 to 84 years (B12002_032E)
                    + 85 years and over (B12002_033E)
                + Married, spouse absent: (B12002_034E)
                    + Separated: (B12002_035E)
                        + 15 to 17 years (B12002_036E)
                        + 18 and 19 years (B12002_037E)
                        + 20 to 24 years (B12002_038E)
                        + 25 to 29 years (B12002_039E)
                        + 30 to 34 years (B12002_040E)
                        + 35 to 39 years (B12002_041E)
                        + 40 to 44 years (B12002_042E)
                        + 45 to 49 years (B12002_043E)
                        + 50 to 54 years (B12002_044E)
                        + 55 to 59 years (B12002_045E)
                        + 60 to 64 years (B12002_046E)
                        + 65 to 74 years (B12002_047E)
                        + 75 to 84 years (B12002_048E)
                        + 85 years and over (B12002_049E)
                    + Other: (B12002_050E)
                        + 15 to 17 years (B12002_051E)
                        + 18 and 19 years (B12002_052E)
                        + 20 to 24 years (B12002_053E)
                        + 25 to 29 years (B12002_054E)
                        + 30 to 34 years (B12002_055E)
                        + 35 to 39 years (B12002_056E)
                        + 40 to 44 years (B12002_057E)
                        + 45 to 49 years (B12002_058E)
                        + 50 to 54 years (B12002_059E)
                        + 55 to 59 years (B12002_060E)
                        + 60 to 64 years (B12002_061E)
                        + 65 to 74 years (B12002_062E)
                        + 75 to 84 years (B12002_063E)
                        + 85 years and over (B12002_064E)
            + Widowed: (B12002_065E)
                + 15 to 17 years (B12002_066E)
                + 18 and 19 years (B12002_067E)
                + 20 to 24 years (B12002_068E)
                + 25 to 29 years (B12002_069E)
                + 30 to 34 years (B12002_070E)
                + 35 to 39 years (B12002_071E)
                + 40 to 44 years (B12002_072E)
                + 45 to 49 years (B12002_073E)
                + 50 to 54 years (B12002_074E)
                + 55 to 59 years (B12002_075E)
                + 60 to 64 years (B12002_076E)
                + 65 to 74 years (B12002_077E)
                + 75 to 84 years (B12002_078E)
                + 85 years and over (B12002_079E)
            + Divorced: (B12002_080E)
                + 15 to 17 years (B12002_081E)
                + 18 and 19 years (B12002_082E)
                + 20 to 24 years (B12002_083E)
                + 25 to 29 years (B12002_084E)
                + 30 to 34 years (B12002_085E)
                + 35 to 39 years (B12002_086E)
                + 40 to 44 years (B12002_087E)
                + 45 to 49 years (B12002_088E)
                + 50 to 54 years (B12002_089E)
                + 55 to 59 years (B12002_090E)
                + 60 to 64 years (B12002_091E)
                + 65 to 74 years (B12002_092E)
                + 75 to 84 years (B12002_093E)
                + 85 years and over (B12002_094E)
        + Female: (B12002_095E)
            + Never married: (B12002_096E)
                + 15 to 17 years (B12002_097E)
                + 18 and 19 years (B12002_098E)
                + 20 to 24 years (B12002_099E)
                + 25 to 29 years (B12002_100E)
                + 30 to 34 years (B12002_101E)
                + 35 to 39 years (B12002_102E)
                + 40 to 44 years (B12002_103E)
                + 45 to 49 years (B12002_104E)
                + 50 to 54 years (B12002_105E)
                + 55 to 59 years (B12002_106E)
                + 60 to 64 years (B12002_107E)
                + 65 to 74 years (B12002_108E)
                + 75 to 84 years (B12002_109E)
                + 85 years and over (B12002_110E)
            + Now married: (B12002_111E)
                + Married, spouse present: (B12002_112E)
                    + 15 to 17 years (B12002_113E)
                    + 18 and 19 years (B12002_114E)
                    + 20 to 24 years (B12002_115E)
                    + 25 to 29 years (B12002_116E)
                    + 30 to 34 years (B12002_117E)
                    + 35 to 39 years (B12002_118E)
                    + 40 to 44 years (B12002_119E)
                    + 45 to 49 years (B12002_120E)
                    + 50 to 54 years (B12002_121E)
                    + 55 to 59 years (B12002_122E)
                    + 60 to 64 years (B12002_123E)
                    + 65 to 74 years (B12002_124E)
                    + 75 to 84 years (B12002_125E)
                    + 85 years and over (B12002_126E)
                + Married, spouse absent: (B12002_127E)
                    + Separated: (B12002_128E)
                        + 15 to 17 years (B12002_129E)
                        + 18 and 19 years (B12002_130E)
                        + 20 to 24 years (B12002_131E)
                        + 25 to 29 years (B12002_132E)
                        + 30 to 34 years (B12002_133E)
                        + 35 to 39 years (B12002_134E)
                        + 40 to 44 years (B12002_135E)
                        + 45 to 49 years (B12002_136E)
                        + 50 to 54 years (B12002_137E)
                        + 55 to 59 years (B12002_138E)
                        + 60 to 64 years (B12002_139E)
                        + 65 to 74 years (B12002_140E)
                        + 75 to 84 years (B12002_141E)
                        + 85 years and over (B12002_142E)
                    + Other: (B12002_143E)
                        + 15 to 17 years (B12002_144E)
                        + 18 and 19 years (B12002_145E)
                        + 20 to 24 years (B12002_146E)
                        + 25 to 29 years (B12002_147E)
                        + 30 to 34 years (B12002_148E)
                        + 35 to 39 years (B12002_149E)
                        + 40 to 44 years (B12002_150E)
                        + 45 to 49 years (B12002_151E)
                        + 50 to 54 years (B12002_152E)
                        + 55 to 59 years (B12002_153E)
                        + 60 to 64 years (B12002_154E)
                        + 65 to 74 years (B12002_155E)
                        + 75 to 84 years (B12002_156E)
                        + 85 years and over (B12002_157E)
            + Widowed: (B12002_158E)
                + 15 to 17 years (B12002_159E)
                + 18 and 19 years (B12002_160E)
                + 20 to 24 years (B12002_161E)
                + 25 to 29 years (B12002_162E)
                + 30 to 34 years (B12002_163E)
                + 35 to 39 years (B12002_164E)
                + 40 to 44 years (B12002_165E)
                + 45 to 49 years (B12002_166E)
                + 50 to 54 years (B12002_167E)
                + 55 to 59 years (B12002_168E)
                + 60 to 64 years (B12002_169E)
                + 65 to 74 years (B12002_170E)
                + 75 to 84 years (B12002_171E)
                + 85 years and over (B12002_172E)
            + Divorced: (B12002_173E)
                + 15 to 17 years (B12002_174E)
                + 18 and 19 years (B12002_175E)
                + 20 to 24 years (B12002_176E)
                + 25 to 29 years (B12002_177E)
                + 30 to 34 years (B12002_178E)
                + 35 to 39 years (B12002_179E)
                + 40 to 44 years (B12002_180E)
                + 45 to 49 years (B12002_181E)
                + 50 to 54 years (B12002_182E)
                + 55 to 59 years (B12002_183E)
                + 60 to 64 years (B12002_184E)
                + 65 to 74 years (B12002_185E)
                + 75 to 84 years (B12002_186E)
                + 85 years and over (B12002_187E)
+ Geography (GEO_ID)
+ Geographic Area Name (NAME)

In [51]:
# set your preference
variables = {
    "B12002_002E": "total_males",
    "B12002_008E": "30_34",
    "B12002_009E": "35_39",
    "B12002_010E": "40_44",
    "B12002_011E": "45_49",
}

In [70]:
plus_divorced = {
    "B12002_002E": "total_males",
    "B12002_009E": "35_39",
    "B12002_010E": "40_44",
    "B12002_011E": "45_49",
}

In [81]:
# searching for cities in the census
# use ACS1 to find only places with populations > 65,000
ced.download(
    "acs/acs1",
    2023,
    download_variables=["NAME"],
    state=NC,
    place="*",
)

   STATE  PLACE                                NAME
0     37  01520           Apex town, North Carolina
1     37  02140      Asheville city, North Carolina
2     37  10740           Cary town, North Carolina
3     37  12000      Charlotte city, North Carolina
4     37  14100        Concord city, North Carolina
5     37  19000         Durham city, North Carolina
6     37  22920   Fayetteville city, North Carolina
7     37  25580       Gastonia city, North Carolina
8     37  28000     Greensboro city, North Carolina
9     37  28080     Greenville city, North Carolina
10    37  31400     High Point city, North Carolina
11    37  34200   Jacksonville city, North Carolina
12    37  55000        Raleigh city, North Carolina
13    37  74440     Wilmington city, North Carolina
14    37  75000  Winston-Salem city, North Carolina

In [72]:
pool = ced.download(
    "acs/acs5",
    2023,
    download_variables = plus_divorced.keys(),
    state = NC,
    place = "02140"
).rename(
    columns = plus_divorced
)

pool.head()

  STATE  PLACE  total_males  35_39  40_44  45_49
0    37  02140        38767   2036   1061    867

In [74]:
pool["eligible"] = pool["35_39"] + pool["40_44"] + pool["45_49"]
pool

  STATE  PLACE  total_males  35_39  40_44  45_49  eligible
0    37  02140        38767   2036   1061    867      3964

In [75]:
pool["eligible"]/pool["total_males"]

0    0.102252
dtype: float64

In [82]:
# try for another place

ced.download(
    "acs/acs1",
    2023,
    download_variables=["NAME"],
    state=MN,
    place="*",
)

   STATE  PLACE                           NAME
0     27  06382         Blaine city, Minnesota
1     27  06616    Bloomington city, Minnesota
2     27  07966  Brooklyn Park city, Minnesota
3     27  17000         Duluth city, Minnesota
4     27  17288          Eagan city, Minnesota
5     27  35180      Lakeville city, Minnesota
6     27  40166    Maple Grove city, Minnesota
7     27  43000    Minneapolis city, Minnesota
8     27  51730       Plymouth city, Minnesota
9     27  54880      Rochester city, Minnesota
10    27  56896      St. Cloud city, Minnesota
11    27  58000       St. Paul city, Minnesota
12    27  71428       Woodbury city, Minnesota

In [ ]:
mn_pool = ced.download(
    "acs/acs5",
    2023,
    download_variables = plus_divorced.keys(),
    state = MN,
    place = "43000"
).rename(
    columns = variables
)

mn_pool.head()

  STATE  PLACE  total_males  35_39  40_44  45_49
0    27  43000       183837   8236   5334   3233

In [84]:
pool["eligible"] = pool["35_39"] + pool["40_44"] + pool["45_49"]
pool

  STATE  PLACE  total_males  35_39  40_44  45_49  eligible
0    27  43000       183837   8236   5334   3233     16803